; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	Star3 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 121)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 183)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 168)
	(= (data Star5 spectrograph1) 158)
	(= (data Phenomenon6 spectrograph1) 87)
	(= (data Phenomenon7 spectrograph1) 148)
	(= (data Planet8 spectrograph1) 72)
	(= (data Planet9 spectrograph1) 94)
	(= (data Star5 spectrograph2) 225)
	(= (data Phenomenon6 spectrograph2) 157)
	(= (data Phenomenon7 spectrograph2) 298)
	(= (data Planet8 spectrograph2) 185)
	(= (data Planet9 spectrograph2) 22)
	(= (data Star5 thermograph0) 118)
	(= (data Phenomenon6 thermograph0) 17)
	(= (data Phenomenon7 thermograph0) 280)
	(= (data Planet8 thermograph0) 296)
	(= (data Planet9 thermograph0) 231)
	(= (slew_time Star3 Star0) 57.38)
	(= (slew_time Star0 Star3) 57.38)
	(= (slew_time Star3 Star1) 32.13)
	(= (slew_time Star1 Star3) 32.13)
	(= (slew_time Star3 Star2) 29.46)
	(= (slew_time Star2 Star3) 29.46)
	(= (slew_time Star1 Star0) 15.51)
	(= (slew_time Star0 Star1) 15.51)
	(= (slew_time Star2 Star0) 40.64)
	(= (slew_time Star0 Star2) 40.64)
	(= (slew_time Star2 Star1) 21.06)
	(= (slew_time Star1 Star2) 21.06)
	(= (slew_time GroundStation4 Star0) 10.88)
	(= (slew_time Star0 GroundStation4) 10.88)
	(= (slew_time GroundStation4 Star1) 28.54)
	(= (slew_time Star1 GroundStation4) 28.54)
	(= (slew_time GroundStation4 Star2) 6.05)
	(= (slew_time Star2 GroundStation4) 6.05)
	(= (slew_time GroundStation4 Star3) 12.19)
	(= (slew_time Star3 GroundStation4) 12.19)
	(= (slew_time Star5 Star0) 40.29)
	(= (slew_time Star0 Star5) 40.29)
	(= (slew_time Star5 Star1) 8.231)
	(= (slew_time Star1 Star5) 8.231)
	(= (slew_time Star5 Star2) 56.45)
	(= (slew_time Star2 Star5) 56.45)
	(= (slew_time Star5 Star3) 29.65)
	(= (slew_time Star3 Star5) 29.65)
	(= (slew_time Star5 GroundStation4) 7.069)
	(= (slew_time GroundStation4 Star5) 7.069)
	(= (slew_time Phenomenon6 Star0) 18.88)
	(= (slew_time Star0 Phenomenon6) 18.88)
	(= (slew_time Phenomenon6 Star1) 32.98)
	(= (slew_time Star1 Phenomenon6) 32.98)
	(= (slew_time Phenomenon6 Star2) 8.117)
	(= (slew_time Star2 Phenomenon6) 8.117)
	(= (slew_time Phenomenon6 Star3) 1.392)
	(= (slew_time Star3 Phenomenon6) 1.392)
	(= (slew_time Phenomenon6 GroundStation4) 69.69)
	(= (slew_time GroundStation4 Phenomenon6) 69.69)
	(= (slew_time Phenomenon6 Star5) 2.415)
	(= (slew_time Star5 Phenomenon6) 2.415)
	(= (slew_time Phenomenon7 Star0) 18.97)
	(= (slew_time Star0 Phenomenon7) 18.97)
	(= (slew_time Phenomenon7 Star1) 6.71)
	(= (slew_time Star1 Phenomenon7) 6.71)
	(= (slew_time Phenomenon7 Star2) 37.72)
	(= (slew_time Star2 Phenomenon7) 37.72)
	(= (slew_time Phenomenon7 Star3) 13.4)
	(= (slew_time Star3 Phenomenon7) 13.4)
	(= (slew_time Phenomenon7 GroundStation4) 49.98)
	(= (slew_time GroundStation4 Phenomenon7) 49.98)
	(= (slew_time Phenomenon7 Star5) 25.04)
	(= (slew_time Star5 Phenomenon7) 25.04)
	(= (slew_time Phenomenon7 Phenomenon6) 80.96)
	(= (slew_time Phenomenon6 Phenomenon7) 80.96)
	(= (slew_time Planet8 Star0) 51.41)
	(= (slew_time Star0 Planet8) 51.41)
	(= (slew_time Planet8 Star1) 59.7)
	(= (slew_time Star1 Planet8) 59.7)
	(= (slew_time Planet8 Star2) 32.54)
	(= (slew_time Star2 Planet8) 32.54)
	(= (slew_time Planet8 Star3) 4.317)
	(= (slew_time Star3 Planet8) 4.317)
	(= (slew_time Planet8 GroundStation4) 34.02)
	(= (slew_time GroundStation4 Planet8) 34.02)
	(= (slew_time Planet8 Star5) 28.33)
	(= (slew_time Star5 Planet8) 28.33)
	(= (slew_time Planet8 Phenomenon6) 18.93)
	(= (slew_time Phenomenon6 Planet8) 18.93)
	(= (slew_time Planet8 Phenomenon7) 2.477)
	(= (slew_time Phenomenon7 Planet8) 2.477)
	(= (slew_time Planet9 Star0) 12.34)
	(= (slew_time Star0 Planet9) 12.34)
	(= (slew_time Planet9 Star1) 15.41)
	(= (slew_time Star1 Planet9) 15.41)
	(= (slew_time Planet9 Star2) 50.44)
	(= (slew_time Star2 Planet9) 50.44)
	(= (slew_time Planet9 Star3) 91.74)
	(= (slew_time Star3 Planet9) 91.74)
	(= (slew_time Planet9 GroundStation4) 10.79)
	(= (slew_time GroundStation4 Planet9) 10.79)
	(= (slew_time Planet9 Star5) 11.45)
	(= (slew_time Star5 Planet9) 11.45)
	(= (slew_time Planet9 Phenomenon6) 28.23)
	(= (slew_time Phenomenon6 Planet9) 28.23)
	(= (slew_time Planet9 Phenomenon7) 54.56)
	(= (slew_time Phenomenon7 Planet9) 54.56)
	(= (slew_time Planet9 Planet8) 2.949)
	(= (slew_time Planet8 Planet9) 2.949)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 183 to 181.608, (fuel-used) from 0 to 1.392
   goals met: 0 of 5
2. (turn_to satellite1 star3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 181.608 to 180.216, (fuel-used) from 1.392 to 2.784
   goals met: 0 of 5
3. (turn_to satellite2 star0 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 168 to 155.66, (fuel-used) from 2.784 to 15.124
   goals met: 0 of 5
4. (turn_to satellite1 phenomenon6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 180.216 to 178.824, (fuel-used) from 15.124 to 16.516
   goals met: 0 of 5
5. (turn_to satellite1 star3 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 178.824 to 177.432, (fuel-used) from 16.516 to 17.908
   goals met: 0 of 5
6. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 5
7. (calibrate satellite2 instrument5 star0)
   added: (calibrated instrument5)
   goals met: 0 of 5
8. (turn_to satellite2 planet9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet9)
   changed: (fuel satellite2) from 155.66 to 143.32, (fuel-used) from 17.908 to 30.248
   goals met: 0 of 5
9. (turn_to satellite1 phenomenon7 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 177.432 to 164.032, (fuel-used) from 30.248 to 43.648
   goals met: 1 of 5
10. (take_image satellite2 planet9 instrument5 spectrograph1)
   added: (have_image planet9 spectrograph1)
   changed: (data_capacity satellite2) from 1000 to 906, (data-stored) from 0 to 94
   goals met: 2 of 5
11. (turn_to satellite2 star5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 143.32 to 131.87, (fuel-used) from 43.648 to 55.098
   goals met: 2 of 5
12. (take_image satellite2 star5 instrument5 spectrograph2)
   added: (have_image star5 spectrograph2)
   changed: (data_capacity satellite2) from 906 to 681, (data-stored) from 94 to 319
   goals met: 3 of 5
13. (turn_to satellite2 phenomenon6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 131.87 to 129.455, (fuel-used) from 55.098 to 57.513
   goals met: 3 of 5
14. (take_image satellite2 phenomenon6 instrument5 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   changed: (data_capacity satellite2) from 681 to 524, (data-stored) from 319 to 476
   goals met: 4 of 5
15. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 129.455 to 110.525, (fuel-used) from 57.513 to 76.443
   goals met: 4 of 5
16. (take_image satellite2 planet8 instrument5 spectrograph2)
   added: (have_image planet8 spectrograph2)
   changed: (data_capacity satellite2) from 524 to 339, (data-stored) from 476 to 661
   goals met: 5 of 5
